class _const:
    class ConstError(TypeError):
        pass

    class ConstCaseError(ConstError):
        pass

    def __setattr__(self, name, value):
        if name in self.__dict__:    #判断是否已经在__dict__中，字典中的值是不能改变的
            raise self.ConstError("Can not change const %s" % name)
        self.__dict__[name] = value


import sys

sys.modules[__name__] = _const()

_const.user_col=[122,123,125,126,127,128,129,130,131,132,133,134,135,137]

_const.dictionary=  {'无崩塌滑坡及冲沟或发育轻微': 0,
                '有零星崩塌滑坡和冲沟存在': 1,
                '崩塌滑坡发育,有零星植被覆盖,冲沟发育': 2,
                '崩塌滑坡严重,表土疏松,冲沟十分发育': 3,
                '轻微': 0,
                '一般': 1,
                '中等': 2,
                '严重': 3,
                '<10%':0,
                '30-10%':1,
                '10-30%':1,
                '60-30%':2,
                '30-60%':2,
                '>60%':3,
                '<3°(<52‰)':0,
                '6-3°(105-52‰)':1,
                '12-6°(213-105‰)':2,
                '>12°(>213‰)':3,
                '沉降区,构造影响小或无影响':0,
                '相对稳定区,4级以下地震区,有小断层':1,
                '抬升区,4-6级地震区,有中小支断层或无断层':2,
                '强抬升区,6级以上地震区':3,
                '<0.2m':0,
                '1-0.2m':1,
                '2-1m':2,
                '>2m':3,
                '10-5m':4,
                '轻微':0,
                '硬岩':1,
                '风化和节理发育的硬岩':1,
                '软硬相间':2,
                '软岩,黄土':3,
                '<1 万立方米/平方公里':0,
                '5-1 万立方米/平方公里':1,
                '10-5 万立方米/平方公里':2,
                '>10 万立方米/平方公里':3,
                '<15°(<268‰)':0,
                '25-15°(466-268‰)':1,
                '32-25°(625-466‰)':2,
                '>32°(>625‰)':3,
                '平坦型':0,
                '复式断面':1,
                '拓宽U型谷':2,
                'V型谷,谷中谷,U型谷':3,
                '<1m':0,
                '5-1m':1,
                '10-5m':2,
                '>10m':3,
                '0.2 以下或10-100 平方公里':0,
                '0.2-5 平方公里':1,
                '<5 平方公里': 1,
                '5-10 平方公里':2,
                '10-100 平方公里':3,
                '>100 平方公里':4,
                '<100m':0,
                '300-100m':1,
                '500-300m':2,
                '>500m':3,

                '不易发':0,
                '$不易发$':0,
                '低易发':1,
                '$低易发$':1,
                '$中易发$':2,
                '中易发':2,
                '$中等$':2,
                '$易发$':3,
                '易发':3,
                '$高易发$':4,
                '高易发':4
        }